<template>
    <NuxtLayout>
        <ServicesHero
            title="Мы оказываем услуги в наиболее востребованных областях права"
            subtitle="Берем на себя процессы сопровождения, оформления, защиты в суде и делопроизводстве, и обеспечиваем прозрачный документооборот на всех этапах работы с оплатой по факту выполнения задачи"
            button-text="Обсудить задачу"
            image-url="/img/temp/temp.jpg"
        />
        <ServicesList
            :data="
                tempServices.map((el) => ({
                    title: el.title,
                    content: el.content,
                    articleId: el.articleId,
                }))
            "
        />
        <ServicesAbout
            title="Мы находим решения в самых сложных правовых ситуациях, обеспечивая надежную защиту и стратегию"
            :slides="tempAboutSlides.map((el) => ({ title: el.title, body: el.content }))"
        />
        <ConnectionSecondary fill style="margin-bottom: 128px" />
    </NuxtLayout>
</template>

<script setup lang="ts">
    const tempServices: {
        title: string;
        content: string;
        articleId?: string;
    }[] = [
        {
            title: 'Защита по уголовным делам',
            content:
                'Для юридических лиц можно пройти аттестацию в одном из государственных аттестационных центрах. Описание – основной смысл. Используйте 1-2 предложения в 1-3 строчки, если выравнивание по центру. При большем количестве текста используйте другой тип выравнивания контента',
        },
        {
            title: 'Помощь в ходе исполнения наказания',
            content:
                'Для юридических лиц можно пройти аттестацию в одном из государственных аттестационных центрах. Описание – основной смысл. Используйте 1-2 предложения в 1-3 строчки, если выравнивание по центру. При большем количестве текста используйте другой тип выравнивания контента',
        },
        {
            title: 'Административные споры',
            content:
                'Для юридических лиц можно пройти аттестацию в одном из государственных аттестационных центрах. Описание – основной смысл. Используйте 1-2 предложения в 1-3 строчки, если выравнивание по центру. При большем количестве текста используйте другой тип выравнивания контента',
        },
        {
            title: 'Арбитраж',
            content:
                'Для юридических лиц можно пройти аттестацию в одном из государственных аттестационных центрах. Описание – основной смысл. Используйте 1-2 предложения в 1-3 строчки, если выравнивание по центру. При большем количестве текста используйте другой тип выравнивания контента',
        },
        {
            title: 'Семейные споры',
            content:
                'Для юридических лиц можно пройти аттестацию в одном из государственных аттестационных центрах. Описание – основной смысл. Используйте 1-2 предложения в 1-3 строчки, если выравнивание по центру. При большем количестве текста используйте другой тип выравнивания контента',
        },
    ];

    const tempAboutSlides: {
        title: string;
        content: string;
    }[] = [
        {
            title: 'Разрешение судебных споров',
            content:
                'Мы постоянно внедряем новые технологии и методы работы, чтобы улучшить качество услуг и повы',
        },
        {
            title: 'Представительство в судах',
            content:
                'Мы постоянно внедряем новые технологии и методы работы, чтобы улучшить качество услуг и повы',
        },
        {
            title: 'Юридическая экспертиза',
            content:
                'Мы постоянно внедряем новые технологии и методы работы, чтобы улучшить качество услуг и повы',
        },
        {
            title: 'Представительство в судах',
            content:
                'Мы постоянно внедряем новые технологии и методы работы, чтобы улучшить качество услуг и повы',
        },
        {
            title: 'Разрешение судебных споров',
            content:
                'Мы постоянно внедряем новые технологии и методы работы, чтобы улучшить качество услуг и повы',
        },
    ];
</script>

<style scoped lang="scss">
    @use '~/assets/scss/abstracts' as *;
</style>
